Feature: Решаване на изпити
  Като студент
  Искам да мога да решавам изпити
  За да мога да получавам оценки

  Background: 
    Given Потребителят е студент и отваря страницата за изпити

  Scenario: Отваряне на изпит, който все още не е започнал
    Given изпит "Изпит 1" все още не е започнал
    When потребителят отвори изпит "Изпит 1" за решаване
    Then вижда съобщение "Изпитът все още не е започнал!"

  Scenario: Изпращане на празно решение на изпит
    When потребителят отвори изпит "Изпит 1" за решаване
    And натисне бутона за изпращане на решението
    Then вижда диалог за потвърждение "Вашето решение е празно, сигурни ли сте че искате да го изпратите?"
    And потвърждава диалога
    And вижда съобщение "Решението беше изпратено успешно!"

  Scenario: Изпращане на непълно решение на изпит
    When потребителят отвори изпит "Изпит 1" за решаване
    And въведе "8" за въпроса "Колко планети има в нашата слънчева система?"
    And натисне бутона за изпращане на решението
    Then вижда диалог за потвърждение "Вашето решение съдържа празни въпроси, сигурни ли сте че искате да го изпратите?"
    And потвърждава диалога
    And вижда съобщение "Решението беше изпратено успешно!"

  Scenario Outline: Изпращане на решение на изпит
    When потребителят отвори изпит "Изпит 1" за решаване
    And отговори на следните въпроси от изпита:
      | Въпрос                                       | Отговор |
      | Колко планети има в нашата слънчева система? |       8 |
      | Коя е столицата на Франция?                  | Париж   |
    And натисне бутона за изпращане на решението
    Then вижда съобщение "Решението беше изпратено успешно!"

  Scenario: Изпращане на решение на изпит с закъснение
    When потребителят отвори изпит "Изпит 1" за решаване
    And отговори на следните въпроси от изпита:
      | Въпрос                                       | Отговор |
      | Колко планети има в нашата слънчева система? |       8 |
      | Коя е столицата на Франция?                  | Париж   |
    Given времето за решаване е изтекло
    When натисне бутона за изпращане на решението
    Then вижда съобщение "Решението беше изпратено успешно!"
